---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.AllowNavigationDuringRedraw
source: html/4692af6d-a7c0-4fce-f129-02df1507df1d.htm
---
# Autodesk.Revit.ApplicationServices.Application.AllowNavigationDuringRedraw Property

Checks whether or not the navigation during redraw is enabled, and enable or disable it.

## Syntax (C#)
```csharp
public bool AllowNavigationDuringRedraw { get; set; }
```